#ifndef EVALUATOR_H
#define EVALUATOR_H

#include "stack.h"
/*
   Модуль вычисления выражений (evaluator):
        Задача: Вычисляет значение выражения, заданного в обратной польской нотации, для конкретного значения
   переменной. Вход: Список лексем в польской нотации и значение переменной x. Выход: Числовое значение
   результата выражения.

    Функции:
        evaluate_rpn(): Принимает выражение в ОПН и вычисляет его значение.
        apply_operator(): Применяет оператор к операндам.
*/

stack_n* evaluate_rpn(char* rpn_string, double* values);

#endif  // EVALUATOR_H