#ifndef EVALUATOR_H
#define EVALUATOR_H

/*
   Модуль вычисления выражений (evaluator):
        Задача: Вычисляет значение выражения, заданного в обратной польской нотации, для конкретного значения
   переменной. Вход: Список лексем в польской нотации и значение переменной x. Выход: Числовое значение
   результата выражения.

    Функции:
        evaluate_rpn(): Принимает выражение в ОНП и вычисляет его значение.
        apply_operator(): Применяет оператор к операндам.
*/

int* evaluate_rpn(char* rpn_string, int* );


#endif // EVALUATOR_H